
[Support_Space_Offensive_IonCannon_T1 X2WeaponTemplate]
FriendlyName="Fire Support: Ion Cannon"
FriendlyNamePlural="Fire Support: Ion Cannon"
BriefSummary="A long-range radio that allows the user to call in an Ion Cannon strike."
TacticalText="<Bullet/>A radio set that's specifically tuned to call in a specific fire support.\n<Bullet/>Ion Cannon: Developed as the next generation strategic armament, it's geosynchronous orbit gives it a diversion factor of 8-to-1.\n<Bullet/>No guarentee for accuracy.\n<Bullet/>Cannot be used underground or inside massive buildings or building complexes."
AbilityDescName="support strike"



[Ability_Support_Orbital_Off_IonCannon_Stage1 X2AbilityTemplate]
LocFriendlyName="Request Strike: Ion Cannon"
LocLongDescription="Requests Ion Cannon strike at the designated location. Takes time for the satellite to align at the location, but the weapon is precise and deadly."
LocHelpText="Delayed Ion Cannon strke at the requested sight."
LocFlyOverText="Request Strike: Ion Cannon"

[Ability_Support_Orbital_Off_IonCannon_Stage2 X2AbilityTemplate]
;LocFriendlyName="YOU SHOULD NOT HAVE THIS ABILITY"
LocLongDescription="Report this bug to E3 if you see this appear."
LocHelpText="Report this bug to E3 if you see this appear."
